Update SYSTEM_ARCHITECTURE.md
